# Lab13

* Create a DataFrame from a CSV file (UN.txt).
* The UN.txt file contains columns: 'Country', 'Continent', 'Population', and 'Area'.

In [53]:
import pandas as pd

df = pd.read_csv('../data/UN.txt', header=None, names=['Country', 'Continent', 'Population', 'Area'])
df.head()

       Country Continent  Population      Area
0  Afghanistan      Asia      31.800  251772.0
1      Albania    Europe       3.000   11100.0
2      Algeria    Africa      38.300  919595.0
3      Andorra    Europe       0.085     181.0
4       Angola    Africa      19.100  481354.0

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Country     193 non-null    object
 1   Continent   193 non-null    object
 2   Population  193 non-null    float64
 3   Area        193 non-null    float64
dtypes: float64(2), object(2)
memory usage: 6.2+ KB

* Given a DataFrame, filter rows in a DataFrame based on a specific area
* Sort the output by area size in descending order

In [57]:
def filter_area(df, area):
    filterd_df = df[df['Area']>area]
    return filterd_df

filter_df = filter_area(df, 1000)
filter_df

         Country      Continent  Population       Area
0    Afghanistan           Asia        31.8   251772.0
1        Albania         Europe         3.0    11100.0
2        Algeria         Africa        38.3   919595.0
4         Angola         Africa        19.1   481354.0
6      Argentina  South America        44.0  1068302.0
..           ...            ...         ...        ...
188    Venezuela  South America        28.9   353841.0
189      Vietnam           Asia        93.4   128527.0
190        Yemen           Asia        26.1   203849.0
191       Zambia         Africa        14.7   290587.0
192     Zimbabwe         Africa        13.8   150871.0

[164 rows x 4 columns]

* Calculate the average population and area of UN member states.

SyntaxError: invalid syntax (83806951.py, line 4)

* Group the DataFrame by 'Continent' and calculate the average population and area for each continent.

In [58]:
grouped_df = df.groupby('Continent')

In [60]:
grouped_df.agg({'Population': 'sum', 'Area': 'sum'})

                   Population         Area
Continent
Africa              1124.1220  11840863.00
Asia                4270.5400  12306588.20
Australia/Oceania     35.9125   3264352.00
Europe               744.5760   8887808.26
North America        555.2360   8697251.00
South America        405.2100   6833472.00

* Find the top N countries with the highest one from the given DataFrame.

In [7]:
df.nlargest(5, ['Population'])

           Country      Continent  Population       Area
35           China           Asia      1355.7  3696100.0
75           India           Asia      1236.3  1269210.0
184  United States  North America       318.9  3794066.0
76       Indonesia           Asia       253.6   735355.0
23          Brazil  South America       202.7  3287597.0

In [8]:
df.nlargest(5, ['Area'])

                Country      Continent  Population       Area
140  Russian Federation         Europe       142.5  6592800.0
30               Canada  North America        34.8  3855000.0
184       United States  North America       318.9  3794066.0
35                China           Asia      1355.7  3696100.0
23               Brazil  South America       202.7  3287597.0

* Merge two DataFrames on a common column 'Name'

In [40]:
df1 = pd.read_csv('../data/employee.csv')
df1

    Name  Age  Salary
0  Alice   30   50000
1    Bob   25   55000
2  Carol   35   60000
3  David   22   45000
4    Eva   28   65000
5  Frank   32   52000
6  Grace   26   58000
7  Helen   29   62000
8   Ivan   24   48000
9   Jack   34   70000

In [41]:
df2 = pd.read_csv('../data/dept.csv')
df2

   ID   Name Department
0   1  Alice         HR
1   2    Bob    Finance
2   3  Carol         IT
3   4  David         HR
4   5    Eva    Finance
5   6  Frank         IT
6   7  Grace         HR
7   8  Helen    Finance
8   9   Ivan         IT
9  10   Jack         HR

In [42]:
df3 = df1.merge(df2, on='Name')
df3

    Name  Age  Salary  ID Department
0  Alice   30   50000   1         HR
1    Bob   25   55000   2    Finance
2  Carol   35   60000   3         IT
3  David   22   45000   4         HR
4    Eva   28   65000   5    Finance
5  Frank   32   52000   6         IT
6  Grace   26   58000   7         HR
7  Helen   29   62000   8    Finance
8   Ivan   24   48000   9         IT
9   Jack   34   70000  10         HR

* Fill missing values in the given csv  - 'https://raw.githubusercontent.com/agconti/kaggle-titanic/master/data/train.csv' 

* Replace missing values in the 'Age' column with the mean age.
* Replace missing values in the 'Cabin' column with the mode value.
* Replace missing values in the 'Embarked' column with the mode value.

In [43]:
df_missing = pd.read_csv('https://raw.githubusercontent.com/agconti/kaggle-titanic/master/data/train.csv')
df_missing.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [46]:
# * Replace missing values in the 'Age' column with the mean age.

df_age = df_missing['Age'].fillna(df_missing['Age'].mean())
df_age.info()

<class 'pandas.core.series.Series'>
RangeIndex: 891 entries, 0 to 890
Series name: Age
Non-Null Count  Dtype
--------------  -----
891 non-null    float64
dtypes: float64(1)
memory usage: 7.1 KB

In [47]:
# * Replace missing values in the 'Cabin' column with the mode value.

df_cabin = df_missing['Cabin'].fillna(df_missing['Cabin'].mode()[0])
df_cabin.info()

<class 'pandas.core.series.Series'>
RangeIndex: 891 entries, 0 to 890
Series name: Cabin
Non-Null Count  Dtype
--------------  -----
891 non-null    object
dtypes: object(1)
memory usage: 7.1+ KB

In [48]:
# * Replace missing values in the 'Embarked' column with the mode value.

df_embarked = df_missing['Embarked'].fillna(df_missing['Embarked'].mode()[0])
df_embarked.info()

<class 'pandas.core.series.Series'>
RangeIndex: 891 entries, 0 to 890
Series name: Embarked
Non-Null Count  Dtype
--------------  -----
891 non-null    object
dtypes: object(1)
memory usage: 7.1+ KB

* Calculate the total fare for each passenger in the given DataFrame.

In [52]:
df_missing.values

array([[1, 0, 3, ..., 7.25, nan, 'S'],
       [2, 1, 1, ..., 71.2833, 'C85', 'C'],
       [3, 1, 3, ..., 7.925, nan, 'S'],
       ...,
       [889, 0, 3, ..., 23.45, nan, 'S'],
       [890, 1, 1, ..., 30.0, 'C148', 'C'],
       [891, 0, 3, ..., 7.75, nan, 'Q']], dtype=object)